{"class_name": "Model", "keras_version": "2.2.0", "config": {"name": "model_1", "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 28, 28, 1], "dtype": "float32"}}, {"name": "sequential_1", "class_name": "Sequential", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "activation": "linear", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "filters": 16, "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "dtype": "float32"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "activation": "linear", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 32}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "momentum": 0.8, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "activation": "linear", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 64}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "momentum": 0.8, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "activation": "linear", "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 128}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}]}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 1, "activation": "sigmoid", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 11, "activation": "softmax", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}