{"class_name": "Model", "keras_version": "2.2.0", "config": {"name": "model_2", "output_layers": [["sequential_2", 1, 0]], "layers": [{"name": "input_3", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_3", "batch_input_shape": [null, 1], "dtype": "int32"}}, {"name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "input_dim": 10, "trainable": true, "embeddings_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_length": null, "batch_input_shape": [null, null], "mask_zero": false, "embeddings_constraint": null, "output_dim": 100, "dtype": "float32"}}, {"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_2", "batch_input_shape": [null, 100], "dtype": "float32"}}, {"name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}}, {"name": "multiply_1", "class_name": "Multiply", "inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "config": {"name": "multiply_1", "trainable": true}}, {"name": "sequential_2", "class_name": "Sequential", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "units": 6272, "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 100], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "dtype": "float32"}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [7, 7, 128]}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "momentum": 0.8, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "activation": "linear", "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 128}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "momentum": 0.8, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "activation": "linear", "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 64}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "momentum": 0.8, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "activation": "linear", "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 1}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]]}, "backend": "tensorflow"}